app/controllers/uploads_controller.rb

  def index
    @uploads = Upload.all
---
SELECT "uploads".* FROM "uploads"

  def create
    @upload = Upload.new(upload_params)

    respond_to do |format|
      if @upload.save
---
INSERT INTO "uploads" ("created_at", "description", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sat, 18 Jan 2014 13:05:42 UTC +00:00], ["description", "dsafdsa"], ["title", "adsa"], ["updated_at", Sat, 18 Jan 2014 13:05:42 UTC +00:00]]

  def destroy
    @upload.destroy
---
DELETE FROM "uploads" WHERE "uploads"."id" = $1  [["id", 1]]

    def set_upload
      @upload = Upload.find(params[:id])
---
SELECT "uploads".* FROM "uploads" WHERE "uploads"."id" = $1 LIMIT 1  [["id", "1"]]